#include <iostream>
#include <string>
using namespace std;

/*
* 样例输入
2
5 5
01111
11001
10101
10001
11111
5 6
111111
100001
010101
100001
111111

样例输出
1
3

样例说明
对于第一组数据，包含两个岛屿，下面用不同的数字进行了区分：

01111
11001
10201
10001
11111

岛屿2 22 在岛屿1 11 的“环” 内部，所以岛屿2 22 是岛屿1 11 的子岛屿，答案为1 11。
对于第二组数据，包含三个岛屿，下面用不同的数字进行了区分：

111111
100001
020301
100001
111111

注意岛屿3 33 并不是岛屿1 11 或者岛屿2 22 的子岛屿，因为岛屿1 11 和岛屿2 22 中均没有“环”。
*/

/*
* 笑死，看完题目描述，很好，不会写
*/


int main()
{
	cout << "hello world" << endl;

	system("pause");
	return 0;
}

